gillwei7/QAR87_NXP_RT685_main/Components_SPI/mimxrt685audevk_freertos_event_spi_cm33/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC0 0x00u            /*!<@brief Selects pin function 0 */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_DI 0x00u         /*!<@brief Disable input buffer function */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name FC0_TXD_SCL_MISO_WS (coord G2), J16[1]/U27[3]/U9[12]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_TXD_PERIPHERAL FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITPINS_DEBUG_UART_TXD_SIGNAL TXD_SCL_MISO_WS
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_TXD_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_TXD_PIN 1U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_DEBUG_UART_TXD_PIN_MASK (1U << 1U)
/* @} */

/*! @name FC0_RXD_SDA_MOSI_DATA (coord G4), JP40[2]
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITPINS_DEBUG_UART_RXD_PERIPHERAL FLEXCOMM0
/*!
 * @brief Signal name */
#define BOARD_INITPINS_DEBUG_UART_RXD_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITPINS_DEBUG_UART_RXD_PORT 0U
/*!
 * @brief PORT pin number */
#define BOARD_INITPINS_DEBUG_UART_RXD_PIN 2U
/*!
 * @brief PORT pin mask */
#define BOARD_INITPINS_DEBUG_UART_RXD_PIN_MASK (1U << 2U)
/* @} */

/*! @name PIO0_26 (coord A2), FUN_KEY1_N
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_LED_BLUE_PERIPHERAL GPIO           /*!<@brief Peripheral name */
#define BOARD_INITPINS_LED_BLUE_SIGNAL PIO0               /*!<@brief Signal name */
#define BOARD_INITPINS_LED_BLUE_CHANNEL 26                /*!<@brief Signal channel */

/* Symbols to be used with GPIO driver */
#define BOARD_INITPINS_LED_BLUE_GPIO GPIO                 /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITPINS_LED_BLUE_GPIO_PIN_MASK (1U << 26U) /*!<@brief GPIO pin mask */
#define BOARD_INITPINS_LED_BLUE_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_LED_BLUE_PIN 26U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_LED_BLUE_PIN_MASK (1U << 26U)      /*!<@brief PORT pin mask */
                                                          /* @} */

/*! @name HS_SPI_SCK (coord L2), JP36[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA0_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA0_SIGNAL SCK                /*!<@brief Signal name */
#define BOARD_INITPINS_QSPI_B_DATA0_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QSPI_B_DATA0_PIN 11U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QSPI_B_DATA0_PIN_MASK (1U << 11U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name HS_SPI_MOSI (coord N1), JP38[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA2_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA2_SIGNAL MOSI               /*!<@brief Signal name */
#define BOARD_INITPINS_QSPI_B_DATA2_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QSPI_B_DATA2_PIN 13U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QSPI_B_DATA2_PIN_MASK (1U << 13U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name HS_SPI_MISO (coord M2), JP37[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA1_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA1_SIGNAL MISO               /*!<@brief Signal name */
#define BOARD_INITPINS_QSPI_B_DATA1_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QSPI_B_DATA1_PIN 12U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QSPI_B_DATA1_PIN_MASK (1U << 12U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name HS_SPI_SSEL0 (coord N2), JP39[2]
  @{ */
/* Routed pin properties */
#define BOARD_INITPINS_QSPI_B_DATA3_PERIPHERAL FLEXCOMM14     /*!<@brief Peripheral name */
#define BOARD_INITPINS_QSPI_B_DATA3_SIGNAL SSEL0              /*!<@brief Signal name */
#define BOARD_INITPINS_QSPI_B_DATA3_PORT 1U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITPINS_QSPI_B_DATA3_PIN 14U                   /*!<@brief PORT pin number */
#define BOARD_INITPINS_QSPI_B_DATA3_PIN_MASK (1U << 14U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*! @name I3C0_SCL (coord N17), J18[1]/U110[13]
  @{ */
/* Routed pin properties */
#define BOARD_I3C_I3C_ICM_SCL_PERIPHERAL I3C            /*!<@brief Peripheral name */
#define BOARD_I3C_I3C_ICM_SCL_SIGNAL SCL                /*!<@brief Signal name */
#define BOARD_I3C_I3C_ICM_SCL_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_I3C_I3C_ICM_SCL_PIN 29U                   /*!<@brief PORT pin number */
#define BOARD_I3C_I3C_ICM_SCL_PIN_MASK (1U << 29U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*! @name I3C0_SDA (coord P16), J18[2]/U110[14]
  @{ */
/* Routed pin properties */
#define BOARD_I3C_I3C_ICM_SDA_PERIPHERAL I3C            /*!<@brief Peripheral name */
#define BOARD_I3C_I3C_ICM_SDA_SIGNAL SDA                /*!<@brief Signal name */
#define BOARD_I3C_I3C_ICM_SDA_PORT 2U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_I3C_I3C_ICM_SDA_PIN 30U                   /*!<@brief PORT pin number */
#define BOARD_I3C_I3C_ICM_SDA_PIN_MASK (1U << 30U)      /*!<@brief PORT pin mask */
                                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void Board_I3C(void); /* Function assigned for the Cortex-M33 */

#define IOPCTL_PIO_ANAMUX_DI 0x00u        /*!<@brief Analog mux is disabled */
#define IOPCTL_PIO_FULLDRIVE_DI 0x00u     /*!<@brief Normal drive */
#define IOPCTL_PIO_FUNC1 0x01u            /*!<@brief Selects pin function 1 */
#define IOPCTL_PIO_INBUF_EN 0x40u         /*!<@brief Enables input buffer function */
#define IOPCTL_PIO_INV_DI 0x00u           /*!<@brief Input function is not inverted */
#define IOPCTL_PIO_PSEDRAIN_DI 0x00u      /*!<@brief Pseudo Output Drain is disabled */
#define IOPCTL_PIO_PULLDOWN_EN 0x00u      /*!<@brief Enable pull-down function */
#define IOPCTL_PIO_PUPD_DI 0x00u          /*!<@brief Disable pull-up / pull-down function */
#define IOPCTL_PIO_SLEW_RATE_NORMAL 0x00u /*!<@brief Normal mode */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void AMP_I2S(void); /* Function assigned for the Cortex-M33 */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
